//week11-7_pacman_part6_show_walls
//修改自week11-6_part5
//小精靈張嘴
void setup(){
  size(600,600);
}
int x = 300-15, y = 300-15, dx = 0, dy = 0, dir = 0; //diff of x y
float m = 0, dm = 0.05; //嘴巴大小mouth, 嘴巴變量改diff of m
boolean [][] bean_eaten = new boolean[20][20]; //java的二維陣
int [][] walls = {
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, //20個0代表沒有牆壁
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0}, //中間都是牆壁
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, //20個0代表沒有牆壁
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0}, //中間都是牆壁
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, //20個0代表沒有牆壁
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0}, //中間都是牆壁
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, //20個0代表沒有牆壁
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0}, //中間都是牆壁
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, //20個0代表沒有牆壁
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0}, //中間都是牆壁
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0}, //中間都是牆壁
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, //20個0代表沒有牆壁
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0}, //中間都是牆壁
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, //20個0代表沒有牆壁
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0}, //中間都是牆壁
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, //20個0代表沒有牆壁
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0}, //中間都是牆壁
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, //20個0代表沒有牆壁
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0}, //中間都是牆壁
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, //20個0代表沒有牆壁
};
void draw(){
  background(0);
  boolean canMoveX = true, canMoveY = true;
  for(int i=0; i<20; i++){
    for(int j=0; j<20; j++){
     if( walls[i][j] == 1){
      fill(255); //白色豆子
      rect( j*30, i*30, 30, 30);
      if(j*30 < x+dx*15 && x+dx*15 <= j*30+30 && i*30 < y  && y     <= i*30+30) canMoveX = false;
      if(j*30 <= x    &&    x <= j*30+30 && i*30 < y+dy*15 && y+dy*15 <= i*30+30) canMoveX = false;
      }else if( bean_eaten[i][j] == false){
        fill(255);
      ellipse(15 + j*30,15 + i*30, 5, 5);
      if (dist(x,y, 15 +j*30, 15 + i*30) < 15 ) bean_eaten[i][j] = true;
      }  
     }
   }
  
  fill(255,255,0);
  float m0 = dir * PI/2; //幾個半PI 有幾個90度
  //ellipse(x,y,30,30);
  arc(x, y, 30, 30, m0 + m, m0 + PI*2-m);//弧度
  if(x+dx >= 15 && x+dx <= 600-15) x += dx; //不超過四周的牆壁
  if(y+dy >= 15 && y+dy <= 600-15) y += dy; //不超過四周的牆壁
  // 豆子 轉折點 座標(15 + j*30, 15 + i*30)
  if((x-15)%30 == 0 && (y-15)%30 == 0){
    if(next==2) { dx = -1; dy = 0; dir = 2;}//dir:2 向左pI
    if(next==0) { dx = +1; dy = 0; dir = 0;}//dir:0 向右0度
    if(next==3) { dx = 0; dy = -1; dir = 3;}//dir:3 向上PI*1.5
    if(next==1) { dx = 0; dy = +1; dir = 1;}//dir:1 向下PI/2
    next = -1; //沒有要轉動喔!
  }
  if(m >= 1 || m < 0) dm = -dm; //正負倒過來
  m+= dm;
}
int next = -1; //一開始沒有要轉動
void keyPressed(){// 按下向建會決定next下一步要怎麼做
  if(keyCode==LEFT) next = 2;
  if(keyCode==RIGHT)next = 0;
  if(keyCode==UP)   next = 3;
  if(keyCode==DOWN) next = 1;

}
